# **Задание 8. Range**
# 1. Изучите статью: https://pythonchik.ru/osnovy/python-range.
# 2. Создайте файл lesson_2_task_8.py.
# 3. Создайте список [ 18, 14, 10, 6, 2 ] с помощью функции range() и выведите его на экран.

lst = [ 18, 14, 10, 6, 2 ]

for x in range (0, len(lst)):
    print(lst[x])


