# **Задание 3. Площадь квадрата**
# 1. Создайте файл lesson_2_task_3.py.
# 2. Напишите функцию square, принимающую 1 аргумент — сторону квадрата — и возвращающую площадь квадрата. 
# *Площадь квадрата = сторона * сторона.*
# 1. Если переданный аргумент был не целым, округлите результат вверх.

x = input("Сторона квадрата: ")

def square(x):

    if  x == int():
        print(return x ** 2)
    if  x == float():
        return round(x) ** 2
        
square(x)