# **Задание 1. Работа со списками**
# 1. Создайте файл lesson_2_task_1.py.
# 2. Дан список lst = [ '🍇', '🍑', '🍐', '🍊', '🍌', '🍎'].
# 3. Выведите на экран первый и последний элементы.


lst = [ '🍇', '🍑', '🍐', '🍊', '🍌', '🍎']

print(lst[0])
print(lst[-1])