# **Задание 8. Range**
# 1. Изучите статью: https://pythonchik.ru/osnovy/python-range.
# 2. Создайте файл lesson_2_task_8.py.
# 3. Создайте список [ 18, 14, 10, 6, 2 ] с помощью функции range() и выведите его на экран.


import numpy as np
arr = np.arange(18, 1, -4)
print(arr)
